Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
tificates" {
+       description      = "Certificate for thebroadinstitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "thebroadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/thebroadinstitute-com",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-thebroadinstitute-com",
            ]
+           domains                    = [
+               "thebroadinstitute.com",
+               "www.thebroadinstitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["thebroadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for thebroadinstitute.info"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "thebroadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/thebroadinstitute-info",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-thebroadinstitute-info",
            ]
+           domains                    = [
+               "thebroadinstitute.info",
+               "www.thebroadinstitute.info",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["thebroadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for thebroadinstitute.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "thebroadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/thebroadinstitute-net",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-thebroadinstitute-net",
            ]
+           domains                    = [
+               "thebroadinstitute.net",
+               "www.thebroadinstitute.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["thebroadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for thebroadinstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "thebroadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/thebroadinstitute-org",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-thebroadinstitute-org",
            ]
+           domains                    = [
+               "thebroadinstitute.org",
+               "www.thebroadinstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["thebroadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for thebroadinstitute.us"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "thebroadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/thebroadinstitute-us",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-thebroadinstitute-us",
            ]
+           domains                    = [
+               "thebroadinstitute.us",
+               "www.thebroadinstitute.us",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broad.dev"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.dev"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broad.dev"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broad-dev-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broad.im"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.im"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broad.im"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broad-im-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broad.institute"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.institute"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broad.institute"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broad-institute-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broad.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broad.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broad-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadapis.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapis.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadapis.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadapis-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadapps.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadapps.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadapps-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadapps.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadapps.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadapps-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadapps.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadapps.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadapps-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.info"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute.info"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute.tv"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.tv"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute.tv"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadinstitute-tv-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["localmail.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for redirect.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "localmail.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "localmail-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["redirect.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for redirect.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "redirect.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "redirect-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["test.broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "test.broadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "test-broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["test.broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "test.broadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "test-broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["test.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "test.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "test-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["test.broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "test.broadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "test-broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["thebroadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "thebroadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "thebroadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["thebroadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.info"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "thebroadinstitute.info"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "thebroadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["thebroadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "thebroadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "thebroadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["thebroadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "thebroadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "thebroadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["thebroadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "thebroadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "thebroadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broad.dev"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.dev"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broad.dev"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broad-dev-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broad.im"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.im"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broad.im"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broad-im-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broad.institute"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.institute"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broad.institute"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broad-institute-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broad.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broad.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broad-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadapis.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapis.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadapis.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadapis-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadapps.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadapps.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadapps-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadapps.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadapps.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadapps-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadapps.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadapps.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadapps.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadapps-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.info"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute.info"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute.tv"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.tv"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute.tv"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadinstitute-tv-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.test.broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.test.broadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-test-broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.test.broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.test.broadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-test-broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.test.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.test.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-test-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.test.broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for test.broadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.test.broadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-test-broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.thebroadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.thebroadinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-thebroadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.thebroadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.info"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.thebroadinstitute.info"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-thebroadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.thebroadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.thebroadinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-thebroadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.thebroadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.thebroadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-thebroadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.thebroadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for thebroadinstitute.us"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.thebroadinstitute.us"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-thebroadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

Plan: 69 to add, 2 to change, 6 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 69 to add, 2 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```